# ViewportDetailNumber Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewportDetailNumber Property
ParameterTypeId Class See Also
---
"Detail Number"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewportDetailNumber { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewportDetailNumber As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewportDetailNumber {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace